app/views/comments/_index.html.erb

	<hr>
  <% @gossip.comment.each do |t|%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 52]]

	    <div class="head">
	        <small><strong class='user'><%= User.find(t.user_id).first_name %> <%= User.find(t.user_id).first_name %>:  </strong></small>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 47], ["LIMIT", 1]]