app/views/gossips/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 49], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" INNER JOIN "join_tags" ON "tags"."id" = "join_tags"."tag_id" WHERE "join_tags"."gossip_id" = $1  [["gossip_id", 52]]
---
    <p class="card-text"><%= t.content %></p>
    <p class="card-text"><small class="text-muted"><%= User.find(t.user_id).first_name %> <%= User.find(t.user_id).last_name %></small></p>
     <%= link_to "clique ici pour acceder au gossip", Gossip.find(t.id), class: "card_link text-right"%>
     <% t.tag.each do |e|%>