app/views/gossips/show.html.erb

    <br>
    <p>Commentaire(<%= @gossip.comment.count%>)</p>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 52]]