app/controllers/gossips_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 47], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips"
---
  def index
    if current_user
      @user = User.find_by(id: session[:user_id]).first_name
    end
    @gossips = Gossip.all

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 52], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" INNER JOIN "join_tags" ON "tags"."id" = "join_tags"."tag_id" WHERE "join_tags"."gossip_id" = $1  [["gossip_id", 52]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 49], ["LIMIT", 1]]
---
  def show
      id = params[:id].to_i
      @gossip = Gossip.find(id)
      @tag = Gossip.find(id).tag
      @tags = Tag.all
      @author = User.find(@gossip.user_id)