app/controllers/like_controller.rb

INSERT INTO "likes" ("user_id", "content_type", "content_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 47], ["content_type", "Gossip"], ["content_id", 52], ["created_at", "2020-02-13 23:08:10.912804"], ["updated_at", "2020-02-13 23:08:10.912804"]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 52], ["LIMIT", 1]]
---
  def create
    puts "test"
    Like.create(user_id: current_user.id,
                content: Gossip.find(params[:gossip_id]),
                content_id: Gossip.find(params[:gossip_id]).id )