app/controllers/sessions_controller_controller.rb

  def create
    my_user = User.find_by(email: params[:email])
    puts params[:email]

    if my_user != nil && my_user.authenticate(params[:password])
      puts "yes"
      session[:user_id] = my_user.id
      puts User.find_by(id: session[:user_id]).first_name
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "admin@admin.fr"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 47], ["LIMIT", 1]]