app/controllers/user_controller.rb

SELECT "cities".* FROM "cities"
---
  def new
    @city = City.all